In [152]:
import os
import numpy as np
import pandas as pd

In [153]:
os.listdir()
os.chdir('git_practice')
os.chdir('Hello_World')

FileNotFoundError: [Errno 2] No such file or directory: 'git_practice'

In [157]:
from env import password, host, user
def get_db_url(user, password, host):
    url = f'mysql+pymysql://{user}:{password}@{host}/employees'

ModuleNotFoundError: No module named 'env'

In [155]:
url

'mysql+pymysql://mirzakhani_1937:p4h6GGRgeslnWcjIFZoViIY3b92EaC18@data.codeup.com/chipotle'

In [156]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'chipotle.employees' doesn't exist")
[SQL: SELECT * FROM employees LIMIT 5 OFFSET 50]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [25]:
#error test: pd.read_sql('SEECT * FROM employees LIMIT 5 OFFSET 50', url)

In [26]:
# error test: pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url+'s')
#t.title as titles

In [27]:
emp_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * from titles',url)

In [28]:

#emp_df

In [29]:
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [30]:
#300024 rows × 6 columns empls, 443308 rows × 4 columns titles

In [31]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [32]:
emp_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [33]:
titles_df.nunique() #7 unique titles

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

In [39]:
titles_df['to_date'].min() #oldest date 1/3/1985

datetime.date(1985, 3, 1)

In [40]:
trim_titles_df = pd.read_sql('SELECT * from titles',url)

In [41]:
check_date = (['9999-01-01'])

In [43]:
#for thing in trim_titles_df:
#    trimmed = trim_titles_df.query('SELECT title FROM titles WHERE to_date not in check_date')

In [44]:
#def drop_nines():
x = 1
check_date = (['9999-01-01'])
shortlist = []
for thing in trim_titles_df:
    if trim_titles_df['to_date'][x] == (['9999-01-01']):
        x = (x+1)
        continue
    else:
        shortlist.append(trim_titles_df['to_date'][x])
        x+= 1
    if x > 300:
        break
#print(type(trim_titles_df['to_date'][x])            )

#print((trim_titles_df['to_date'][x]) == (['9999-01-01']))
print(trim_titles_df)

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [45]:
trim_titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

# PART 2

In [46]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [47]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [48]:
users = users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

In [49]:
users

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

# left and outer join

In [50]:
#using a right join keeps id_x, name_x, role_id, id_y, name_y, and merge INDICATOR
#it dropped 2 people though, hsa 4 people joined on both columns,1R

In [51]:
#using an outer join keeps the same columns, but includes all 7 people
# has 4-2-1 for both, left, and right types of merge

# number 4: dropping foreign keys

In [52]:
#if you dropped the foreign keys, but kept the id and role_id, the tables
#should merge correctly, there wouldn't be much data in it

In [ ]:
#pd.merge(user, roles,
 #remove > #left_on='id'
 #remove > #right_on='id',
         #how='outer',
         #indicator=True)

In [3]:
#LOAD MPG DATA SET
from pydataset import data

In [4]:
mpg_df = data('mpg')

## SHOW DOC NO S AT THE END, SHOW DOC SHOW DOC

In [5]:
#data('mpg',show_doc=True) #****SHOW DOC NO S AT THE END, SHOW DOC SHOW DOC****

In [6]:
mpg_df.shape

(234, 11)

In [7]:
mpg_df.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [8]:
mpg_df.rename(columns={'class':'size_class'}) #could also do something like change fuel to 
                                                #be more readable, put full word not 1 letter

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,size_class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [78]:
mpg_df.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [86]:
mpg_df.manufacturer

1            audi
2            audi
3            audi
4            audi
5            audi
          ...
230    volkswagen
231    volkswagen
232    volkswagen
233    volkswagen
234    volkswagen
Name: manufacturer, Length: 234, dtype: object

In [87]:
mpg_df.manufacturer.nunique()

15

In [88]:
mpg_df.model.nunique()

38

In [95]:
mpg_df['mileage_difference'] = ((mpg_df.hwy) - (mpg_df.cty))

In [97]:
#mpg_df

In [104]:
mpg_df.sort_values(by=['mileage_difference'])

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
204,toyota,toyota tacoma 4wd,3.4,1999,6,manual(m5),4,15,17,r,pickup,2
177,toyota,4runner 4wd,3.4,1999,6,manual(m5),4,15,17,r,suv,2
152,nissan,pathfinder 4wd,3.3,1999,6,manual(m5),4,15,17,r,suv,2
85,ford,f150 pickup 4wd,4.2,1999,6,manual(m5),4,14,17,r,pickup,3
30,chevrolet,k1500 tahoe 4wd,5.3,2008,8,auto(l4),4,11,14,e,suv,3
...,...,...,...,...,...,...,...,...,...,...,...,...
106,honda,civic,1.8,2008,4,auto(l5),f,25,36,r,subcompact,11
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,11
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,12
107,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,12

In [9]:
#df['passing_math'] = np.where(df.math >= 70, 'passing', 'failing')

Average mileage:

In [10]:
mpg_df['average_mileage'] = (((mpg_df.hwy) + (mpg_df.cty))/2)

In [17]:
mpg_df['average_mileage'] = round(2 / ((1/mpg_df.hwy) +((1/mpg_df.cty)), 2))

TypeError: unsupported operand type(s) for /: 'int' and 'tuple'

#mpt_df['average_mileage'] = round(2 / ((1/mpg_df.highway) +((1/mpg_df.city)), 2))

Automatic or manual:

In [22]:
#data('mpg', show_doc=True) #>> trying to figure out more for the

In [23]:
#mpg_df['is_automatic'] = np.where(mpg_df['trans'] 'auto',"Is auto", "Not auto")
mpg_df['transmission']= mpg_df['trans'].str.contains('auto',na=False)

In [24]:
mpg_df['transmission']

1       True
2      False
3      False
4       True
5       True
       ...
230     True
231    False
232     True
233    False
234     True
Name: transmission, Length: 234, dtype: bool

In [ ]:
#mpg['is_automatic'] = mpg.transmission.str.contains('auto')

In [25]:
#the average mpg of all models for each manufacturer

In [28]:
mpg_df.groupby('manufacturer').average_mileage.mean().sort_values(ascending=True)

manufacturer
land rover    14.000000
lincoln       14.166667
dodge         15.540541
jeep          15.562500
mercury       15.625000
ford          16.680000
chevrolet     18.447368
nissan        21.346154
pontiac       21.700000
toyota        21.720588
audi          22.027778
subaru        22.428571
hyundai       22.750000
volkswagen    25.074074
honda         28.500000
Name: average_mileage, dtype: float64

In [29]:
mpg_df.groupby('manufacturer').average_mileage.mean().nlargest(5)

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
subaru        22.428571
audi          22.027778
Name: average_mileage, dtype: float64

## do automatic or manual have better mpg

In [38]:
mpg_df['transmisson_category'] = np.where(mpg_df.trans.str.contains('auto'),'automatic', 'manual')

In [40]:
#mpg_df

In [41]:
#manuals seem to have better mileage in this dataset

# Part 3

In [127]:
user = 'mirzakhani_1937'
password ='p4h6GGRgeslnWcjIFZoViIY3b92EaC18'
host = 'data.codeup.com'
url = f'mysql+pymysql://{user}:{password}@{host}/chipotle'

In [128]:
#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#pd.read_sql('SELECT * FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE="BASE TABLE"', url)

In [130]:
order = pd.read_sql('SELECT * FROM orders', url)

In [ ]:
#order

In [121]:
x=0
cur_order_total = 0
list_of_totals = []
prev_id = 0
while True:
    if order.order_id[x] == prev_id:
        cur_order_total += order.item_price[x]
        x += 1
    else:
        prev_id += 1
        x += 1

TypeError: unsupported operand type(s) for +=: 'int' and 'str'

In [122]:
order.order_id[x]

1

In [132]:
order['item_price'] = order.item_price.str.replace('$','').astype(float)

/var/folders/wt/3cxh0y194wx3qr52k_wthmwc0000gn/T/ipykernel_1963/1324341478.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  order['item_price'] = order.item_price.str.replace('$','').astype(float)

In [134]:
order_totals = order.groupby('order_id').item_price.sum()

In [135]:
order_totals

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

In [108]:
order.item_price[40]

'$2.15 '

In [98]:
chipotle_df = pd.read_sql('SELECT * FROM orders', url)
#chipotle_df

In [90]:
import statistics
from statistics import mode

                                  item_name item_price
0              Chips and Fresh Tomato Salsa     $2.39
1                                      Izze     $3.39
2                          Nantucket Nectar     $3.39
3     Chips and Tomatillo-Green Chili Salsa     $2.39
4                              Chicken Bowl    $16.98
...                                     ...        ...
4617                          Steak Burrito    $11.75
4618                          Steak Burrito    $11.75
4619                     Chicken Salad Bowl    $11.25
4620                     Chicken Salad Bowl     $8.75
4621                     Chicken Salad Bowl     $8.75

[4622 rows x 2 columns]

In [125]:
statistics.mode(chipotle_df.item_name)

'Chicken Bowl'

In [84]:
pd.read_sql('SELECT item_name FROM orders', url)

# 3 most popular items
probably looking for mode

In [140]:
order.groupby('item_name').quantity.sum(n).sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

# 4. item with most revenue

In [144]:
order.groupby('item_name').item_price.sum().sort_values(ascending=False).head(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

# join tables together

In [159]:
qu = 'SELECT * FROM employees'

In [160]:
employees = pd.read_sql(qu, get_db_url('employees'))
employees.head(10)

NameError: name 'get_db_url' is not defined

In [148]:
qu2 = 'SELECT * FROM titles'

In [151]:
titles = pd.read_sql(qu2, get_db_url('employees'))

NameError: name 'get_db_url' is not defined

## for each title find the hire date of most recent hire

In [158]:
all_emp_titles.groupby('title').hire_date.max()

NameError: name 'all_emp_titles' is not defined

## write code ncessary to create cross tabulation of number of titles by dept

In [179]:
dept_title_query = '''
                    SELECT t.emp_no,
                    t.title,
                    t.to_date,
                    d.dept_name
                    FROM departments AS d
                    JOIN dept_emp AS de USING(dept_no)
                    JOIN titles AS t using(emp_no)

'''

In [180]:
urlE = 'mysql+pymysql://mirzakhani_1937:p4h6GGRgeslnWcjIFZoViIY3b92EaC18@data.codeup.com/employees'

In [181]:
dept_titles = pd.read_sql(dept_title_query, urlE)
dept_titles.head()

   emp_no         title     to_date         dept_name
0   10011         Staff  1996-11-09  Customer Service
1   10038  Senior Staff  9999-01-01  Customer Service
2   10038         Staff  1996-09-20  Customer Service
3   10049  Senior Staff  9999-01-01  Customer Service
4   10049         Staff  2000-05-04  Customer Service

In [ ]:
all_titles_crosstab = pd.crosstab(dept_titles.dept_name, dept_titles.dept_title)